console.log("Loaded KO");

export default {
  hello: "Hello",
  welcome: "Hello {name}!",
  "menu.axisj": "액시스제이",
  "menu.notice": "공지사항",
  "menu.service": "사업분야",
  "menu.solution": "액스프레임",
  "menu.design": "디자인",
  "menu.contact": "연락처",
  "menu.blog": "블로그",
  "menu.group.lang": "언어선택",

  "hero-title-1": "Pioneering a dot",
  "hero-title-p-1": "시작은 작은 꿈에서 시작하고...",
  "hero-title-2": "Connecting the dots",
  "hero-title-p-2":
    "현재의 점들이 미래로 연결된다는 믿음이 우리의 가슴을 뛰게 만들며...",
  "hero-title-3": "We are a dot",
  "hero-title-p-3":
    "세상의 모든 가치가 연결되는 순간,우리는 놀라운 경험을 얻게 됩니다.",
  "hero-title-4": "A dot is a world",
  "hero-title-p-4": "점 하나의 세상. 액시스제이",

  "footer-addr": "서울시 영등포구 양평로14길 13, 3F (우.07222)",
  "footer-family": "Family Site",
  "footer-select-1": "액시스제이",
  "footer-select-2": "액스프레임",

  "history-title-1": "History",
  "history-text-1": "액스모즈(ModsAX)",
  "history-text-2": "오픈소스 액시스제이 런칭",
  "history-text-3": "액스부트 런칭",
  "history-text-4": "오픈소스 업데이트 종료",
  "history-text-5": "액시스제이 법인설립",
  "history-text-6": "액스프레임 베타 런칭",

  "title-ci": "로고",
  "ci-desc":
    "점은 하나의 세계입니다. 우리는 모두 각자의 우주를 가지고 있습니다. IT라는 세상을 한걸음 한걸음 나아간 발걸음은 하나의 궤적이 되었습니다. 오늘도 '헬로우 월드'로 시작하는 당신께 놀라운 경험을 선물합니다. 우리는 무한한 가능성을 가진 점에서 시작합니다.",
  "title-color-primary": "Primary Colors",
  "color-primary-1": "수퍼노바 레드 Supernova Red",
  "color-primary-2": "스페이스 블루 Space Blue",
  "color-primary-3": "딥 블랙 Deep Black",
  "title-color-wild": "Wildcard Colors",
  "color-wild-1": "데저트 옐로우 : Desert Yellow",
  "color-wild-2": "리프 그린 : Leaf Green",
  "color-wild-3": "샌디 브라운 : Sandy Brown",
  "color-wild-4": "스카이 블루 : Sky Blue",

  "title-design": "디자인",
  "design-1-title": "신뢰",
  "design-1-desc":
    "우리의 디자인은 믿고 의지할 수 있어야 합니다. 신뢰는 욕심을 내려 놓을 때 얻을 수 있는 마음입니다. 일관된 목적을 가지고 헤매지 않고 도달할 수 있도록 깔끔하고 명확하게 디자인합니다.<br /><br />뜨거운 컵을 들고 있다면 '뜨겁다' 하지 말고 그냥 놓으면 되는데, '어떻게 놓아야 하는데요'라고 묻는 것과 같습니다. 놓는 기술이 부족한 게 아니다. 뜨겁긴 한데 갖고 싶으니까 못 놓을 뿐입니다. <br /><br />핫하고 트렌디한 디자인만 쫓다보면 핵심되는 초점을 잃어 일관성을 놓치게 되고, 이는 곧 신뢰를 잃게 될 것입니다. 믿을 수 없다면 존재하지 않은 것과 다를 바가 없습니다.",
  "design-2-title": "연결",
  "design-2-desc":
    "기술과 사람을 연결합니다. 그리고 이 연결은 유기적이며 좋은 경험을 줄 수 있도록 디자인되어야 합니다. 연결은 관계를 형성하며 이들 사이에 원활한 소통이 될 수 있도록 능동적이며 긍정적으로 디자인합니다.<br /><br />하나의 점(Dot)이 움직이면 에너지를 만들어 내고 또한 자취를 남깁니다. 점의 자취는 거시적인 관점에서 연결되어 선이 됩니다. 더 나아가 면, 그리고 입체로 복잡한 형태를 발전하지요. 연결된 관계에선 암묵적인 질서의 규칙이 있습니다. 그 규칙은 바로 ‘배려’입니다. 한 점이 다음 점으로 나아갈 수 있는 시간과 공간을 내어 주는 일. 기다리고 들어주는 마음입니다.<br /><br />예를 들면 사용자가 기능을 직관적으로 파악할 수 있는 모양이나 색상처럼 사소해 보이는 부분도 해당하며, 환경적, 경제적, 사회적으로 연결된 관계를 고려하는 부분도 배려라고 할 수 있습니다. 연결은 지속 가능한 디자인을 만들 수 있습니다.",
  "design-3-title": "성장",
  "design-3-desc":
    "디자인은 인간의 정신과 삶의 표현이자 시대와 문화를 이해하고 해석하는 힘을 가지고 있습니다. 결국 인간의 중심에서 디자인을 시작합니다. 하지만 인간도 대자연의 일부임을 알고 겸손과 변화를 받아드려야 합니다. 대자연의 신비로운 현상을 인간의 관점에서 새롭게 해석하고 구체화하는 일을 게을리해서는 안되겠지요.<br /><br />목표나 결과에 지나치게 집착한 나머지 선결되어야 하는 기초적이고 우선적인 조건들을 무시하거나 간과해서는 알 될 것입니다. 오만과 편견을 버리고 겸손한 자세로 세상을 바라볼 때 성장할 수 있습니다. 이는 무한한 가능성 시작입니다.",
  "design-4-title": "균형",
  "design-4-desc":
    "비례, 구조, 스타일링, 기술의 요소가 조화를 이루는 것. 심미적으로 자연스러운 디자인을 추구합니다. 흑과 백, 음과 양, 선과 악과 같이 이분법적인 사고는 빠르게 현상을 정의하고 실행에 옮길 수 있습니다. 하지만 어느 한쪽으로 치우쳐 있다면 균형이 깨지고 말 것입니다.<br /><br />세상의 조화는 유연함에 있습니다. 사전적 의미로 부드럽고 약하는 말은 생각이 말랑말랑 하다는 뜻이기도 합니다. 사고의 범위를 확장하고, 한 걸음 물러나 먼거리에서 바라 보며 균형을 맞추는 일. 넣을 것과 뺄 것을 구분하여 불필요한 관심을 일으키지 않아야 합니다. 이는 사용자에게 전달할 가치를 타협하거나 포기하지 않으면서도 더 나은 경험을 전달 할 것입니다.",

  "title-service": "사업분야",
  "service-1-title": "B2B 솔루션 개발",
  "service-1-desc": `우리의 B2B 솔루션은 혁신적인 기술을 통한 최적화된 비즈니스 솔루션으로 AXFrame을 기반으로 생산되어 안정성과 보안성 또한 검증되었습니다.  
고객의 독특한 요구사항에 맞춤화된 개발, 뛰어난 보안 및 안정성, 유연한 확장성 및 다양한 시스템과의 효율적인 통합, 사용자 중심의 진보된 UI/UX 디자인, 데이터 기반의 스마트한 의사 결정을 지원하는 분석과 인텔리전스, 그리고 지속적인 업그레이드와 효과적인 기술 지원을 통해 고객사의 비즈니스 성과를 높이고 지속적인 성장을 촉진합니다.`,
  "service-2-title": "IT서비스",
  "service-2-desc": `고객의 IT 업무를 완벽히 대행하여 혁신적이고 맞춤형 솔루션을 제공하며, 산업 트렌드에 민감하게 대응하고 최신 기술을 활용하여 고객의 요구를 충족시킵니다. 
홈페이지 및 앱 개발 등 다양한 IT 서비스 분야에서 우수한 전문성을 발휘하여 고객의 비즈니스 성과를 극대화합니다. 이와 함께, 안정성과 신뢰성을 기반으로 한 우리의 IT 서비스는 고객들에게 믿음직한 파트너로 인정받고 있습니다. 최신 기술과 업계 표준을 준수하여 안전하게 데이터를 처리하며, 우수한 기술 지원과 효과적인 커뮤니케이션을 통해 고객의 신뢰를 계속해서 쌓아가고 있습니다.`,
  "service-3-title": "AXFrame 교육",
  "service-3-desc": `저희 회사는 자랑스러운 구성원들로 이뤄진 팀으로, 각자 업계 경력 20년 이상을 자랑하는 전문가들이 모여 있습니다. 
이러한 풍부한 전문성을 바탕으로, 우리는 고객의 요구에 맞춤화된 교육 프로그램을 제공하고 있습니다. 특히 AXFrame 교육은 고객의 업무 효율성을 높이고 업무에 대한 이해도와 자신감을 향상시키기 위해 목적을 두고 있습니다. 우리는 고객사의 상황을 고려한 맞춤 교육 프로그램을 제공하여 개발자들의 만족도를 높이고 기업의 생산성을 향상시키며, 더 나아가 높은 완성도의 소프트웨어 개발을 실현하고자 노력하고 있습니다.`,

  "axframe.tit": "액스프레임",
  "axframe.desc": `액스프레임(AxFrame)은 리액트(React) 기반의 웹앱 개발 프레임워크로, 빠르고 쉽게 고품질의 웹 애플리케이션을 구축할 수 있게 해줍니다. 이 프레임워크는 프론트엔드 개발의 최신 기술들(예: React, TypeScript, Zustand, AntDesign)을 활용하여 개발자들에게 즐거운 작업 경험을 제공합니다. 액스프레임은 웹 애플리케이션 개발에 필수적인 핵심 모듈들을 프리셋으로 제공함으로써 개발자들이 단기간에 완성도 높은 애플리케이션을 개발할 수 있도록 지원합니다.

특히, 액스프레임은 다국어 확장, 테마 확장 등 사용자의 편의성을 극대화할 수 있는 UI 관련 기능들을 제공합니다. 그 중에서도 탭 네비게이션 기능은 사용자의 입력 상태를 각 탭에 유지시켜주고, 브라우저의 히스토리와 연계되어 이전에 경험하지 못했던 편리한 사용자 경험을 제공합니다. 새로운 프로젝트를 준비 중이시라면 액스프레임을 활용해 보는 것을 추천합니다.`,
  "axframe.use-case": "AXFrame UseCases",

  "contact.tit": "오시는 길",
  "contact.address": "주소",
  "contact.zipcode": "우편번호",
  "contact.tel": "전화번호",
  "contact.email": "이메일 주소",
} as const;
