console.log("Loaded KO");

export default {
  hello: "Hello",
  welcome: "Hello {name}!",
  "menu.axisj": "액시스제이",
  "menu.notice": "공지사항",
  "menu.service": "사업분야",
  "menu.solution": "액스프레임",
  "menu.design": "디자인",
  "menu.contact": "연락처",
  "menu.group.lang": "언어선택",

  "hero-title-1": "Pioneering a dot",
  "hero-title-p-1": "시작은 작은 꿈에서 시작하고...",
  "hero-title-2": "Connecting the dots",
  "hero-title-p-2":
    "현재의 점들이 미래로 연결된다는 믿음이 우리의 가슴을 뛰게 만들며...",
  "hero-title-3": "We are a dot",
  "hero-title-p-3":
    "세상의 모든 가치가 연결되는 순간,우리는 놀라운 경험을 얻게 됩니다.",
  "hero-title-4": "A dot is a world",
  "hero-title-p-4": "점 하나의 세상. 액시스제이",

  "footer-addr": "서울시 영등포구 양평로14길 13, 3F (우.07222)",
  "footer-family": "Family Site",
  "footer-select-1": "액시스제이",
  "footer-select-2": "액스프레임",

  "history-title-1": "History",
  "history-text-1": "액스모즈(ModsAX)",
  "history-text-2": "오픈소스 액시스제이 런칭",
  "history-text-3": "액스부트 런칭",
  "history-text-4": "오픈소스 업데이트 종료",
  "history-text-5": "액시스제이 법인설립",

  "title-ci": "로고",
  "ci-desc":
    "점은 하나의 세계입니다. 우리는 모두 각자의 우주를 가지고 있습니다. IT라는 세상을 한걸음 한걸음 나아간 발걸음은 하나의 궤적이 되었습니다. 오늘도 '헬로우 월드'로 시작하는 당신께 놀라운 경험을 선물합니다. 우리는 무한한 가능성을 가진 점에서 시작합니다.",
  "title-color-primary": "Primary Colors",
  "color-primary-1": "수퍼노바 레드 Supernova Red",
  "color-primary-2": "스페이스 블루 Space Blue",
  "color-primary-3": "딥 블랙 Deep Black",
  "title-color-wild": "Wildcard Colors",
  "color-wild-1": "데저트 옐로우 : Desert Yellow",
  "color-wild-2": "리프 그린 : Leaf Green",
  "color-wild-3": "샌디 브라운 : Sandy Brown",
  "color-wild-4": "스카이 블루 : Sky Blue",

  "title-design": "디자인",
  "design-1-title": "신뢰",
  "design-1-desc":
    "우리의 디자인은 믿고 의지할 수 있어야 합니다. 신뢰는 욕심을 내려 놓을 때 얻을 수 있는 마음입니다. 일관된 목적을 가지고 헤매지 않고 도달할 수 있도록 깔끔하고 명확하게 디자인합니다.<br /><br />뜨거운 컵을 들고 있다면 '뜨겁다' 하지 말고 그냥 놓으면 되는데, '어떻게 놓아야 하는데요'라고 묻는 것과 같습니다. 놓는 기술이 부족한 게 아니다. 뜨겁긴 한데 갖고 싶으니까 못 놓을 뿐입니다. <br /><br />핫하고 트렌디한 디자인만 쫓다보면 핵심되는 초점을 잃어 일관성을 놓치게 되고, 이는 곧 신뢰를 잃게 될 것입니다. 믿을 수 없다면 존재하지 않은 것과 다를 바가 없습니다.",
  "design-2-title": "연결",
  "design-2-desc":
    "기술과 사람을 연결합니다. 그리고 이 연결은 유기적이며 좋은 경험을 줄 수 있도록 디자인되어야 합니다. 연결은 관계를 형성하며 이들 사이에 원활한 소통이 될 수 있도록 능동적이며 긍정적으로 디자인합니다.<br /><br />하나의 점(Dot)이 움직이면 에너지를 만들어 내고 또한 자취를 남깁니다. 점의 자취는 거시적인 관점에서 연결되어 선이 됩니다. 더 나아가 면, 그리고 입체로 복잡한 형태를 발전하지요. 연결된 관계에선 암묵적인 질서의 규칙이 있습니다. 그 규칙은 바로 ‘배려’입니다. 한 점이 다음 점으로 나아갈 수 있는 시간과 공간을 내어 주는 일. 기다리고 들어주는 마음입니다.<br /><br />예를 들면 사용자가 기능을 직관적으로 파악할 수 있는 모양이나 색상처럼 사소해 보이는 부분도 해당하며, 환경적, 경제적, 사회적으로 연결된 관계를 고려하는 부분도 배려라고 할 수 있습니다. 연결은 지속 가능한 디자인을 만들 수 있습니다.",
  "design-3-title": "성장",
  "design-3-desc":
    "디자인은 인간의 정신과 삶의 표현이자 시대와 문화를 이해하고 해석하는 힘을 가지고 있습니다. 결국 인간의 중심에서 디자인을 시작합니다. 하지만 인간도 대자연의 일부임을 알고 겸손과 변화를 받아드려야 합니다. 대자연의 신비로운 현상을 인간의 관점에서 새롭게 해석하고 구체화하는 일을 게을리해서는 안되겠지요.<br /><br />목표나 결과에 지나치게 집착한 나머지 선결되어야 하는 기초적이고 우선적인 조건들을 무시하거나 간과해서는 알 될 것입니다. 오만과 편견을 버리고 겸손한 자세로 세상을 바라볼 때 성장할 수 있습니다. 이는 무한한 가능성 시작입니다.",
  "design-4-title": "균형",
  "design-4-desc":
    "비례, 구조, 스타일링, 기술의 요소가 조화를 이루는 것. 심미적으로 자연스러운 디자인을 추구합니다. 흑과 백, 음과 양, 선과 악과 같이 이분법적인 사고는 빠르게 현상을 정의하고 실행에 옮길 수 있습니다. 하지만 어느 한쪽으로 치우쳐 있다면 균형이 깨지고 말 것입니다.<br /><br />세상의 조화는 유연함에 있습니다. 사전적 의미로 부드럽고 약하는 말은 생각이 말랑말랑 하다는 뜻이기도 합니다. 사고의 범위를 확장하고, 한 걸음 물러나 먼거리에서 바라 보며 균형을 맞추는 일. 넣을 것과 뺄 것을 구분하여 불필요한 관심을 일으키지 않아야 합니다. 이는 사용자에게 전달할 가치를 타협하거나 포기하지 않으면서도 더 나은 경험을 전달 할 것입니다.",
} as const;
